init.org
#+title: rthoma's .emacs file

#+begin_src emacs-lisp
;;; -*- lexical-binding: t -*-
#+end_src

* Startup
** Set the garbage collector threshold to avoid unnecessary collections

#+begin_src emacs-lisp
(setq gc-cons-percentage 0.5
      gc-cons-threshold (* 128 1024 1024))

(add-hook 'after-init-hook #'garbage-collect t)

(add-hook 'emacs-startup-hook
          (lambda ()
            (setq gc-cons-threshold (* 16 1024 1024)
                  gc-cons-percentage 0.1)))
#+end_src

** Report time spent loading this module

#+begin_src emacs-lisp
(eval-and-compile
  (defconst emacs-start-time (current-time))

  (defun report-time-since-load (&optional suffix)
    (message "Loading init...done (%.3fs)%s"
             (float-time (time-subtract (current-time) emacs-start-time))
             suffix)))

(add-hook 'after-init-hook
          #'(lambda () (report-time-since-load " [after-init]"))
          t)
#+end_src

** During loading of this module, clear =file-name-handler-alist=

#+begin_src emacs-lisp
(defvar file-name-handler-alist-old file-name-handler-alist)

(setq file-name-handler-alist nil)

(add-hook 'after-init-hook
          #'(lambda ()
              (setq file-name-handler-alist file-name-handler-alist-old)))
#+end_src

** Disable global eldoc-mode

#+begin_src emacs-lisp
(remove-hook 'after-change-major-mode-hook
             'global-eldoc-mode-enable-in-buffers)

(global-eldoc-mode -1)
#+end_src

* Package setup
** Initialize the package manager and configure archives

#+begin_src emacs-lisp
(require 'package)
(setq package-enable-at-startup nil)

(setq package-archives
      '(("gnu" . "https://elpa.gnu.org/packages/")
        ("melpa" . "https://melpa.org/packages/")
        ("melpa-stable" . "https://stable.melpa.org/packages/")))
#+end_src

** Bootstrapping =use-package=

#+begin_src emacs-lisp
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(eval-and-compile
  (require 'use-package))

(let ((verbose (or nil init-file-debug)))
  (setq use-package-verbose verbose
        use-package-expand-minimally (not verbose)
        use-package-compute-statistics verbose
        debug-on-error verbose
        debug-on-message "finalizer failed"
        debug-on-quit verbose))
#+end_src

** Basic customization
*** emacs

#+begin_src emacs-lisp
(use-package emacs                      ;; not an actual package
  :no-require t
  ;;
  :custom
  (inhibit-startup-screen t)
  (line-number-mode t)
  (column-number-mode t)

  ;; bytecomp.el
  (byte-compile-verbose nil)

  ;; files.el
  (backup-by-copying t)
  (delete-old-versions t)
  (kept-new-versions 3)
  (kept-old-versions 2)
  (version-control t)

  ;; paragraphs.el
  (sentence-end-double-space nil)

  ;; paren.el
  (show-paren-delay 0)

  ;; time.el
  (display-time-24hr-format t)
  (display-time-default-load-average nil)
  ;;
  :init
  (add-to-list 'default-frame-alist '(fullscreen . maximized))

  (display-time)

  (when (fboundp 'menu-bar-mode) (menu-bar-mode -1))
  (when (fboundp 'tool-bar-mode) (tool-bar-mode -1))
  (when (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
  (when (fboundp 'electric-indent-mode) (electric-indent-mode -1))

  (setq-default indent-tabs-mode nil)
  (setq-default octave-block-offset 4)

  (when (eq system-type 'darwin)
    (setq mac-option-key-is-meta t
          mac-command-key-is-meta nil
          mac-command-modifier 'control
          mac-option-modifier 'meta))

  (when (eq system-type 'windows-nt)
    (setq w32-pass-lwindow-to-system nil
          w32-pass-rwindow-to-system nil
          w32-pass-alt-to-system nil))

  (let ((font (cond
               ((eq system-type 'darwin) "Menlo-12")
               ((eq system-type 'windows-nt) "Consolas-10")
               ((eq system-type 'gnu/linux) "DejaVu Sans Mono-12"))))
    (when font
      (add-to-list 'default-frame-alist `(font . ,font))
      (set-frame-font font nil t)))
  ;;
  :config
  (defalias 'yes-or-no-p 'y-or-n-p)

  (defun rthoma/terminal-visible-bell ()
    "A friendlier visual bell effect."
    (invert-face 'mode-line)
    (run-with-timer 0.1 nil 'invert-face 'mode-line))

  (setq visible-bell nil
        ring-bell-function #'rthoma/terminal-visible-bell)

  (let ((backup-dir (expand-file-name "~/.emacs.d/saves")))
    (unless (file-exists-p backup-dir)
      (make-directory backup-dir t))
    (setq backup-directory-alist `(("." . ,backup-dir)))))
#+end_src

** Built-ins
*** recentf

#+begin_src emacs-lisp
(use-package recentf
  :demand t
  :commands (recentf-mode
             recentf-add-file
             recentf-apply-filename-handlers)
  ;;
  :custom
  (recentf-auto-cleanup 60)
  (recentf-exclude
   '("~\\'" "\\`out\\'" "\\.log\\'" "^/[^/]*:" "\\.el\\.gz\\'"))
  (recentf-max-saved-items 1024)
  ;;
  :preface
  (defun rthoma/recentf-add-dired-directory ()
    "Add directories visit by dired into recentf."
    (if (and dired-directory
             (stringp dired-directory)
             (file-directory-p dired-directory)
             (not (string= "/" dired-directory)))
        (let ((last-idx (1- (length dired-directory))))
          (recentf-add-file
           (if (= ?/ (aref dired-directory last-idx))
               (substring dired-directory 0 last-idx)
             dired-directory)))))
  ;;
  :hook (dired-mode . rthoma/recentf-add-dired-directory)
  ;;
  :config
  (recentf-mode 1))
#+end_src

*** savehist

#+begin_src emacs-lisp
(use-package savehist
  :unless noninteractive
  ;;
  :custom
  (savehist-additional-variables
   '(file-name-history
     kmacro-ring
     compile-history
     compile-command))
  (savehist-autosave-interval 60)
  (savehist-ignored-variables
   '(load-history
     flyspell-auto-correct-ring
     org-roam-node-history
     magit-revision-history
     org-read-date-history
     query-replace-history
     yes-or-no-p-history
     kill-ring))
  (savehist-mode t)
  ;;
  :config
  (savehist-mode 1))
#+end_src

*** server

#+begin_src emacs-lisp
(use-package server  ;; Start Emacs server (i.e., emacs --daemon)
  :defer 2
  :config
  (when (fboundp 'server-running-p)
    (unless (server-running-p)
      (server-start))))
#+end_src

*** whitespace

#+begin_src emacs-lisp
(use-package whitespace
  :diminish whitespace-mode
  :bind (:map whitespace-mode-map
              ("C-c s w" . whitespace-mode))
  :init
  (setq whitespace-line-column 79)
  (add-hook 'before-save-hook #'delete-trailing-whitespace))
#+end_src

** Completions
*** completion-preview

#+begin_src emacs-lisp
(use-package completion-preview
  :demand t
  :if (version<= "30.1" emacs-version)
  :diminish completion-preview-mode
  :config
  (global-completion-preview-mode 1))
#+end_src

*** consult

#+begin_src emacs-lisp
(use-package consult
  :ensure t
  :bind (("C-s"   . consult-line)
         ("C-x b" . consult-buffer)
         ("M-y"   . consult-yank-pop))
  :custom
  ;; Preview results immediately on selection
  (consult-preview-key 'any))
#+end_src

**** consult-dir

#+begin_src emacs-lisp
(use-package consult-dir
  :ensure t
  :bind (("M-g d" . consult-dir)
         :map minibuffer-local-completion-map
         ("M-s f" . consult-dir-jump-file)
         ("M-g d" . consult-dir)))

(use-package consult-dir-vertico        ;; not an actual package
  :no-require t
  :after (consult-dir vertico)
  :defines (vertico-map)
  :bind (:map vertico-map
              ("M-g d" . consult-dir)
              ("M-s f" . consult-dir-jump-file)))
#+end_src

*** corfu

#+begin_src emacs-lisp
(use-package corfu
  :ensure t
  :demand t
  :bind (("M-/" . completion-at-point)
         :map corfu-map
         ("C-n"      . corfu-next)
         ("C-p"      . corfu-previous)
         ("<escape>" . corfu-quit)
         ("<return>" . corfu-insert))
  ;;
  :custom
  (corfu-auto nil)
  (corfu-auto-prefix 2)
  (corfu-auto-delay 0.25)
  (corfu-min-width 80)
  (corfu-max-width corfu-min-width)
  (corfu-count 14)
  (corfu-scroll-margin 4)
  (corfu-cycle nil)
  (corfu-quit-at-boundary nil)
  (corfu-separator ?\s)
  (corfu-quit-no-match 'separator)
  (corfu-preview-current 'insert)
  ;;
  :config
  (global-corfu-mode))
#+end_src

