init.org
*** cape

#+begin_src emacs-lisp
(use-package cape
  :ensure t
  :demand t
  :bind (:prefix-map
         my-cape-map
         :prefix "C-c ."
         ("p" . completion-at-point)
         ("t" . complete-tag)
         ("d" . cape-dabbrev)
         ("f" . cape-file)
         ("k" . cape-keyword)
         ("s" . cape-elisp-symbol)
         ("a" . cape-abbrev)
         ("l" . cape-line))
  :init
  ;; Add `completion-at-point-functions', used by `completion-at-point'.
  (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-file)
  (add-to-list 'completion-at-point-functions #'cape-abbrev))

(use-package elisp-mode-cape            ;; not an actual package
  :no-require t
  :after (cape elisp-mode)
  :hook (emacs-lisp-mode . rthoma/setup-elisp)
  :preface
  (defun rthoma/setup-elisp ()
    (setq-local completion-at-point-functions
                `(,(cape-capf-super
                    #'elisp-completion-at-point
                    #'cape-dabbrev)
                  cape-file)
                cape-dabbrev-min-length 5)))
#+end_src

*** embark

#+begin_src emacs-lisp
(use-package embark
  :bind (("M-."   . embark-act)
         ("C-M-." . embark-act-all)
         ("C-h b" . embark-bindings)    ;; alternative for `describe-bindings'
         ("C-c v" . embark-dwim)
         :map embark-collect-mode-map
         ("C-c C-a" . embark-collect-direct-action-minor-mode))
  ;;
  :custom
  (embark-indicators
   '(embark-minimal-indicator
     embark-highlight-indicator
     embark-isearch-highlight-indicator))
  ;;
  :init
  ;; Optionally replace the key help with a completing-read interface
  (setq prefix-help-command #'embark-prefix-help-command)

  ;; Show the Embark target at point via Eldoc. You may adjust the
  ;; Eldoc strategy, if you want to see the documentation from
  ;; multiple providers.
  (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
  ;;
  :config
  ;; Hide the mode line of the Embark live/completions buffers
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none)))))

***** notes

[[https://github.com/oantolin/embark][embark]] makes it easy to choose a command to run based on what is near
point, both during a minibuffer completion session (in a way familiar
to Helm or Counsel users) and in normal buffers. Bind the command
=embark-act= to a key and it acts like prefix-key for a keymap of
/actions/ (commands) relevant to the /target/ around point. With point
on an URL in a buffer you can open the URL in a browser or eww or
download the file it points to. If while switching buffers you spot an
old one, you can kill it right there and continue to select another.
Embark comes preconfigured with over a hundred actions for common
types of targets such as files, buffers, identifiers, s-expressions,
sentences; and it is easy to add more actions and more target types.
Embark can also collect all the candidates in a minibuffer to an
occur-like buffer or export them to a buffer in a major-mode specific
to the type of candidates, such as dired for a set of files, ibuffer
for a set of buffers, or customize for a set of variables.

**** embark-consult

#+begin_src emacs-lisp
(use-package embark-consult             ;; package hosted on elpa
  :ensure t
  :defer t
  :hook
  (embark-collect-mode . consult-preview-at-point-mode))
#+end_src

***** notes

[[https://github.com/oantolin/embark/blob/master/embark-consult.el][embark-consult]] provides integration between Embark and Consult. The
package will be loaded automatically by Embark.

Some of the functionality here was previously contained in Embark
itself:

- Support for =consult-buffer=, so that you get the correct actions
  for each type of entry in =consult-buffer='s list.

- Support for =consult-line=, =consult-outline=, =consult-mark= and
  =consult-global-mark=, so that the insert and save actions don't
  include a weird unicode character at the start of the line, and so
  you can export from them to an occur buffer (where =occur-edit-mode=
  works!).

Just load this package to get the above functionality, no further
configuration is necessary.

Additionally this package contains some functionality that has never
been in Embark: access to Consult preview from auto-updating Embark
Collect buffer that is associated to an active minibuffer for a
Consult command. For information on Consult preview, see Consult's
info manual or its readme on GitHub.

*** marginalia

#+begin_src emacs-lisp
(use-package marginalia
  :ensure t
  :init
  (marginalia-mode))
#+end_src

*** orderless

#+begin_src emacs-lisp
(use-package orderless
  :ensure t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides '((file (styles partial-completion)))))
#+end_src

*** vertico

#+begin_src emacs-lisp
(use-package vertico
  :ensure t
  :after cape                           ; because this defines C-c .
  :demand t
  ;;
  :custom
  (vertico-count 10)
  (vertico-cycle t)
  ;;
  :config
  (vertico-mode)

  ;; Do not allow the cursor in the minibuffer prompt
  (setq minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))

  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

  ;; Hide commands in M-x which do not work in the current mode. Vertico
  ;; commands are hidden in normal buffers.
  (setq read-extended-command-predicate
        #'command-completion-default-include-p)

  (use-package vertico-repeat
    :demand t
    :bind
    (("C-c . ." . vertico-repeat)
     :map vertico-map
     ("M-P" . vertico-repeat-previous)
     ("M-N" . vertico-repeat-next))
    :hook
    (minibuffer-setup . vertico-repeat-save))

  ;; Enable ivy-like path editing
  (use-package vertico-directory
    :ensure nil                         ;; it's included in vertico
    :bind (:map vertico-map
                ("<backspace>"   . vertico-directory-delete-char)
                ("C-w"           . vertico-directory-delete-word)
                ("C-<backspace>" . vertico-directory-delete-word))
    :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))

  (use-package vertico-quick
    :demand t
    :bind (:map vertico-map
                ("C-." . vertico-quick-exit)
                ("<S-return>" . vertico-quick-exit)
                ("M->" . vertico-quick-embark))
    :preface
    (defun vertico-quick-embark (&optional arg)
      "Embark on candidate using quick keys."
      (interactive)
      (when (vertico-quick-jump)
        (embark-act arg)))))
#+end_src

*** yasnippet

#+begin_src emacs-lisp
(use-package yasnippet
  :ensure t
  :defer t
  ;;
  :diminish yas-minor-mode
  :commands yas-minor-mode-on
  ;;
  :bind (("C-c y x" . yas-expand)
         :map yas-keymap
         ("C-i" . yas-next-field-or-maybe-expand))
  :hook (prog-mode . yas-minor-mode-on)
  ;;
  :custom
  (yas-prompt-functions '(yas-completing-prompt yas-no-prompt))
  (yas-triggers-in-field t)
  (yas-wrap-around-region t)
  ;;
  :config
  (yas-reload-all)
  ;; Add yasnippet to the completion sources
  (add-to-list 'completion-at-point-functions #'cape-yasnippet))

(use-package yasnippet-org              ;; not an actual package
  :no-require t
  :after org
  ;;
  :hook
  (org-mode . yas-minor-mode-on)
  (org-tab-after-check-for-cycling . yas-expand))
#+end_src

**** consult-yasnippet

#+begin_src emacs-lisp
(use-package consult-yasnippet
  :ensure t
  :after (consult yasnippet))
#+end_src

** Packages
*** exec-path-from-shell

#+begin_src emacs-lisp
(use-package exec-path-from-shell
  :ensure t
  :defer 3
  :config
  (when (eq system-type 'darwin)
    (exec-path-from-shell-initialize)))
#+end_src

*** iedit

#+begin_src emacs-lisp
(use-package iedit
  :ensure t
  :defer t
  :bind (("C-c i" . iedit-mode)))
#+end_src

*** json

#+begin_src emacs-lisp
(use-package json-mode
  :ensure t
  :defer t
  :bind (:map json-mode-map
              ("C-c C-f" . json-pretty-print-buffer)))
#+end_src

**** json-snatcher

#+begin_src emacs-lisp
(use-package json-snatcher
  :ensure t
  :defer t
  :after json-mode)
#+end_src

