init.el

(use-package latex
  :ensure auctex
  :defer t
  ;;
  :bind (:map LaTeX-mode-map
              ("C-c o" . fill-region))
  ;;
  :init
  (when (eq system-type 'darwin)
    (setq ispell-program-name "aspell"
          ispell-extra-args '("--sug-mode=ultra" "--lang=en_US")
          exec-path (append exec-path
                            '("/usr/texbin" "/usr/local/Cellar/aspell/0.60.8/bin")))

    (setenv "PATH" (concat (getenv "PATH")
                           ":/usr/local/Cellar/aspell/0.60.8/bin:/usr/texbin")))

  (when (eq system-type 'windows-nt)
    (setq ispell-program-name "C:/Program Files/GNU Emacs/hunspell-1.3.2-3-w32-bin/bin/hunspell.exe"
          ispell-local-dictionary "en_US"
          ispell-local-dictionary-alist
          '(("en_US" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "en_US") nil utf-8))))
  ;;
  :hook
  (bibtex-mode . (lambda () (set-fill-column 69)))

  ;; Turn on flyspell, math mode, and reftex by default
  (LaTeX-mode . flyspell-mode)
  (LaTeX-mode . LaTeX-math-mode)
  (LaTeX-mode . turn-on-reftex)

  (TeX-mode . (lambda ()
                (setq TeX-command-default "latexmk")))
  ;;
  :config
  ;; Set the list of viewers for macOS
  (when (eq system-type 'darwin)
    (setq TeX-view-program-list
          '(("Preview" "open -a Preview.app %o")
            ("Skim" "open -a Skim.app %o")
            ("displayline"
             "/Applications/Skim.app/Contents/SharedSupport/displayline -b %n %o %b")
            ("open" "open %o"))))

  ;; Set the list of viewers for Windows
  (when (eq system-type 'windows-nt)
    (setq TeX-view-program-list
          '(("Sumatra"
             "\"C:/Program Files (x86)/SumatraPDF/SumatraPDF.exe\" -reuse-instance %o")
            ("displayline"
             "\"C:/Program Files (x86)/SumatraPDF/SumatraPDF.exe\" -reuse-instance -forward-search %b %n %o")
            ("open" "open %o"))))

  ;; Select the viewer for each file type
  (setq TeX-view-program-selection
        '((output-dvi "open")
          (output-pdf "displayline")
          (output-html "open")))

  ;; Set up LaTeX to use latexmk and make available by C-c C-c
  (unless (assoc "latexmk" TeX-command-list)
    (push '("latexmk" "latexmk -pdf %s" TeX-run-TeX nil t
            :help "Run latexmk on file")
          TeX-command-list))

  (setq LaTeX-indent-environment-list
        '(("frame")
          ("verbatim" current-indentation)
          ("verbatim*" current-indentation)
          ("tabular")
          ("tabular*")
          ("align")
          ("align*")
          ("array")
          ("eqnarray")
          ("eqnarray*")
          ("displaymath")
          ("equation")
          ("equation*")
          ("picture")
          ("tabbing")))

  (setq reftex-plug-into-AUCTeX t
        bibtex-align-at-equal-sign t
        LaTeX-indent-level 4
        LaTeX-item-indent 0
        LaTeX-left-right-indent-level 4
        TeX-brace-indent-level 4
        tex-indent-item 4
        tex-indent-basic 4
        tex-indent-arg 4
        reftex-level-indent 4)

  ;; Add files with this extension to the clean up list
  (add-to-list 'LaTeX-clean-intermediate-suffixes "\\.fdb_latexmk" t))

(use-package markdown-mode
  :ensure t
  :defer t
  ;;
  :commands (markdown-mode gfm-mode)
  :mode
  ("README\\.md\\'" . gfm-mode)
  ("\\.md\\'" . markdown-mode)
  ("\\.markdown\\'" . markdown-mode)
  ;;
  :init
  (setq markdown-command "multimarkdown")
  ;;
  :hook
  (markdown-mode . (lambda () (setq markdown-fontify-code-blocks-natively t))))

(use-package octave
  :ensure nil                           ;; built-in
  :defer t
  :mode ("\\.m\\'" . octave-mode))

(use-package org
  :ensure nil                           ;; built-in
  :defer t
  ;;
  :mode ("\\.org\\'" . org-mode)
  ;;
  :bind (:map org-mode-map
              ("C-c l" . org-store-link)
              ("C-c a" . org-agenda)
              ("C-c c" . org-capture)
              ("C-c b" . org-iswitchb))
  ;;
  :config
  (setq org-todo-keywords
        '((sequence "TODO" "PROG" "WAIT" "CANC" "DONE")))

  (setq org-todo-keyword-faces
        '(("TODO" . org-todo)
          ("PROG" . (:foreground "#74D3D5" :weight bold))
          ("WAIT" . (:foreground "#F2E1AC" :weight bold))
          ("CANC" . org-todo)
          ("DONE" . org-done)))

  (setq org-directory "~/.emacs.d/orgfiles/"
        org-archive-location "~/.emacs.d/orgfiles/archive/"
        user-full-name "rthoma"
        org-src-preserve-indentation t
        org-log-done 'time))

(use-package python
  :defer t
  ;;
  :hook
  (python-mode . eglot-ensure)
  (python-mode . yas-minor-mode)
  ;;
  :config
  (add-to-list 'python-shell-completion-native-disabled-interpreters "ipython")
  (setq python-shell-interpreter "ipython"
        python-shell-interpreter-args "--simple-prompt"
        python-shell-prompt-detect-failure-warning nil)

  (defun rthoma/python-interrupt ()
    "Send SIGINT to the Python process named 'Python'."
    (interactive)
    (let ((proc (get-process "Python")))
      (if (and proc (process-live-p proc))
          (interrupt-process proc)
        (message "No active Python process found."))))

  (define-key python-mode-map (kbd "C-c C-k") #'rthoma/python-interrupt)
  (define-key inferior-python-mode-map (kbd "C-c C-k") #'rthoma/python-interrupt))

(use-package doom-themes
  :ensure t
  :config
  (load-theme 'doom-one t)

  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(package-selected-packages nil))
;;
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 )

(report-time-since-load)

;; Local Variables:
;; byte-compile-warnings: (not docstrings lexical noruntime)
;; End:

;; eof
